def class_ip(ip):
    ip = ip.split('.')
    if len(ip[0]) == 8:
        if 0 <= int(ip[0], 2) < 128:
            print(
                'Класс сети: A \nНачальный адрес: 0.0.0.0 \nКонечный адрес: 127.255.255.255 \nМаска подсети: 255.0.0.0')
        elif 128 <= int(ip[0], 2) < 192:
            print(
                'Класс сети: B \nНачальный адрес: 128.0.0.0 \nКонечный адрес: 191.255.255.255 \nМаска подсети: '
                '255.255.0.0')
        elif 192 <= int(ip[0], 2) < 224:
            print(
                'Класс сети: C \nНачальный адрес: 192.0.0.0 \nКонечный адрес: 223.255.255.255 \nМаска подсети: '
                '255.255.255.0')
        elif 224 <= int(ip[0], 2) < 240:
            print(
                'Класс сети: D \nНачальный адрес: 224.0.0.0 \nКонечный адрес: 239.255.255.255 \nМаска подсети: '
                '255.255.255.0')
        elif 240 <= int(ip[0], 2) < 256:
            print(
                'Класс сети: E \nНачальный адрес: 240.0.0.0 \nКонечный адрес: 255.255.255.255 \nМаска подсети: '
                '255.255.255.0')
    else:
        if 0 <= int(ip[0]) < 128:
            print(
                'Класс сети: A \nНачальный адрес: 0.0.0.0 \nКонечный адрес: 127.255.255.255 \nМаска подсети: 255.0.0.0')
        elif 128 <= int(ip[0]) < 192:
            print(
                'Класс сети: B \nНачальный адрес: 128.0.0.0 \nКонечный адрес: 191.255.255.255 \nМаска подсети: '
                '255.255.0.0')
        elif 192 <= int(ip[0]) < 224:
            print(
                'Класс сети: C \nНачальный адрес: 192.0.0.0 \nКонечный адрес: 223.255.255.255 \nМаска подсети: '
                '255.255.255.0')
        elif 224 <= int(ip[0]) < 240:
            print(
                'Класс сети: D \nНачальный адрес: 224.0.0.0 \nКонечный адрес: 239.255.255.255 \nМаска подсети: '
                '255.255.255.0')
        elif 240 <= int(ip[0]) < 256:
            print(
                'Класс сети: E \nНачальный адрес: 240.0.0.0 \nКонечный адрес: 255.255.255.255 \nМаска подсети: '
                '255.255.255.0')
    return ''


print(class_ip(input('Введите IP: ')))
